STMicroelectronics/OpenOCD/src/flash/nor/spc56x.c
	if (bank->base == 0x0)
	{
		for (i = first; i <= last; i++) {
			if (i < spc56x_info->low_max_index) {
				low_mask |= (1 << i);
			} else if (i < spc56x_info->mid_max_index) {
				mid_mask |= (1 << (i - spc56x_info->low_max_index));
			} else if (i < spc56x_info->high_max_index) {
				high_mask |= (1 << (i - spc56x_info->mid_max_index));
			}
		}
	}
	else if (bank->base == 0x180000)
	{
/*
		for (i = first; i <= last; i++) {
			if (i < spc56x_info->high_max_index) {
				high_mask |= (1 << (i + 8));
			}
		}
*/
		for (i = first; i <= last; i++) {
			if (i < spc56x_info->low_max_index) {
				low_mask |= (1 << i);
			} else if (i < spc56x_info->mid_max_index) {
				mid_mask |= (1 << (i - spc56x_info->low_max_index));
			} else if (i < spc56x_info->high_max_index) {
				high_mask |= (1 << (i - spc56x_info->mid_max_index));
			}
		}
	}
	else if (bank->base == 0x800000)
	{
		for (i = first; i <= last; i++) {
			if (i < spc56x_info->low_max_index) {
				low_mask |= (1 << i);
			}
		}
	}


	/* unlock flash registers */
	uint32_t lock_state;

	if (low_mask != 0) {
		err = spc56x_getlock(bank, LOCK_LOW_PRIMARY, &lock_state);
		if (err != ERROR_OK)
			return err;

		err = spc56x_setlock(bank, LOCK_LOW_PRIMARY, (lock_state & 0xFFFF0000));
		if (err != ERROR_OK)
			return err;

		err = spc56x_getlock(bank, LOCK_LOW_SECONDARY, &lock_state);
		if (err != ERROR_OK)
			return err;

		err = spc56x_setlock(bank, LOCK_LOW_SECONDARY, (lock_state & 0xFFFF0000));
		if (err != ERROR_OK)
			return err;
	}

	if (mid_mask != 0) {
		err = spc56x_getlock(bank, LOCK_MID_PRIMARY,  &lock_state);
		if (err != ERROR_OK)
			return err;

		err = spc56x_setlock(bank, LOCK_MID_PRIMARY, (lock_state & 0xFFFFFFFC));
		if (err != ERROR_OK)
			return err;

		err = spc56x_getlock(bank, LOCK_MID_SECONDARY,  &lock_state);
		if (err != ERROR_OK)
			return err;

		err = spc56x_setlock(bank, LOCK_MID_SECONDARY, (lock_state & 0xFFFFFFFC));
		if (err != ERROR_OK)
			return err;
	}

	if (high_mask != 0) {
		err = spc56x_getlock(bank, LOCK_HIGH, &lock_state);
		if (err != ERROR_OK)
			return err;

		err = spc56x_setlock(bank, LOCK_HIGH, (lock_state & 0xFFFFF000));
		if (err != ERROR_OK)
			return err;
	}

	/* Set arch info */
	powerpc_info.common_magic = POWERPC_COMMON_MAGIC;

	/* SSD structure */
	if (target_alloc_working_area(target, sizeof(struct _ssd_config),
			&ssd_config) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do SSD config allocation");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};


	err = target_write_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);
	if (err != ERROR_OK)
		return err;


	/* Flash erase code */
	if (target_alloc_working_area(target, sizeof(spc56x_flash_erase_code),
			&erase_algorithm) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do flash erase step");
		target_free_working_area(target, ssd_config);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	err = target_write_buffer(target, erase_algorithm->address,
			sizeof(spc56x_flash_erase_code), (uint8_t *)spc56x_flash_erase_code);
	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, erase_algorithm);
		return err;
	}

	/* ssd_config (in), return value (out) */
	init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
	buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

	/* eraseOption shadowFlag (0x0) */
	init_reg_param(&reg_params[1], "r4", 32, PARAM_IN);
	buf_set_u32(reg_params[1].value, 0, 32, 0);

	/* lowBlockSelect */
	init_reg_param(&reg_params[2], "r5", 32, PARAM_IN);
	buf_set_u32(reg_params[2].value, 0, 32, low_mask);

	/* midBlockSelect */
	init_reg_param(&reg_params[3], "r6", 32, PARAM_IN);
	buf_set_u32(reg_params[3].value, 0, 32, mid_mask);

	/* highBlockSelect */
	init_reg_param(&reg_params[4], "r7", 32, PARAM_IN);
	buf_set_u32(reg_params[4].value, 0, 32, high_mask);

	/* CallBack */
	init_reg_param(&reg_params[5], "r8", 32, PARAM_IN);
	buf_set_u32(reg_params[5].value, 0, 32, 0xFFFFFFFF);


	/*
	 * Link register (in).
	 * Set link register to the breakpoint instruction at the end of the buffer.
	 * We use a software breakpoint to notify when done with algorithm execution.
	 */
	init_reg_param(&reg_params[6], "lr", 32, PARAM_IN);
	buf_set_u32(reg_params[6].value, 0, 32, erase_algorithm->address + (sizeof(spc56x_flash_erase_code) - 2));

	init_reg_param(&reg_params[7], "r1", 32, PARAM_IN);
	buf_set_u32(reg_params[7].value, 0, 32, target->working_area_phys + target->working_area_size - 1);


	err = target_run_algorithm(target,
			0, NULL,
			8, reg_params,
			erase_algorithm->address, (erase_algorithm->address + erase_algorithm->size),
			10000, &powerpc_info);

	if ((err != ERROR_OK) || (buf_get_u32(reg_params[0].value, 0, 32) != 0)) {
		err = ERROR_TARGET_FAILURE;
	}

	destroy_reg_param(&reg_params[0]);
	destroy_reg_param(&reg_params[1]);
	destroy_reg_param(&reg_params[2]);
	destroy_reg_param(&reg_params[3]);
	destroy_reg_param(&reg_params[4]);
	destroy_reg_param(&reg_params[5]);
	destroy_reg_param(&reg_params[6]);
	destroy_reg_param(&reg_params[7]);

	/* Free resources */
	target_free_working_area(target, ssd_config);
	target_free_working_area(target, erase_algorithm);

	return err;
}

static int spc56x_protect(struct flash_bank *bank, int set, unsigned int first, unsigned int last)
{
	struct target *target = bank->target;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	return ERROR_OK;
}

/*offset = base address count = size */
static int spc56x_write(struct flash_bank *bank, const uint8_t *buffer,
		uint32_t offset, uint32_t count)
{
	LOG_DEBUG("%s:%d %s()", __FILE__, __LINE__, __func__);
	LOG_DEBUG("%s:%d %s() offset = 0x%08x count = 0x%08x", __FILE__, __LINE__, __func__, offset, count);

	unsigned int i, sector = 0;

	for(i=0; i < bank->num_sectors; i++)
		LOG_DEBUG("-----> bank->sectors[%d].offset = 0x%08x (size = %d K)", i, bank->sectors[i].offset, (bank->sectors[i].size/1024));

