STMicroelectronics/OpenOCD/src/flash/nor/spc56x.c
	struct powerpc_algorithm powerpc_info;
	struct target *target = bank->target;
	struct spc56x_flash_bank *spc56x_info = bank->driver_priv;

	static struct working_area *source;
	struct working_area *write_algorithm;
	struct working_area *ssd_config;

	struct reg_param reg_params[8];
	SSD_CONFIG *ssd = &spc56x_info->ssd;
	int err = ERROR_OK;


	uint32_t chunk_number;
	uint32_t bytes_remain;
	int32_t tot_sector = 0;
	uint32_t size = 0;
	uint32_t chunk_size = 0x400; /* internal buffer size 1024 bytes */

	/* Set arch info */
	powerpc_info.common_magic = POWERPC_COMMON_MAGIC;

    if (count > chunk_size)
    {
    	size = chunk_size;
    	bytes_remain = count % chunk_size;
    	chunk_number = count / chunk_size;
    }
    else
    {
    	size = count;
    	bytes_remain = 0;
    	chunk_number = 1;
    }



	if (target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	err = spc56x_setlock(bank, LOCK_LOW_PRIMARY, 0x0);
	if (err != ERROR_OK)
		return err;

	err = spc56x_setlock(bank, LOCK_LOW_SECONDARY, 0x0);
	if (err != ERROR_OK)
		return err;

	err = spc56x_setlock(bank, LOCK_MID_PRIMARY, 0x0);
	if (err != ERROR_OK)
		return err;

	err = spc56x_setlock(bank, LOCK_MID_SECONDARY, 0x0);
	if (err != ERROR_OK)
		return err;

	err = spc56x_setlock(bank, LOCK_HIGH, 0x0);
	if (err != ERROR_OK)
		return err;


	for(i = 0; i < bank->num_sectors; i++)
	{
		if((offset >= bank->sectors[i].offset) && (offset < bank->sectors[i+1].offset)) {
			/* sector found */
			sector = i;
			tot_sector++;
			LOG_DEBUG("Sector found: %d IN_offset= 0x%08x, bank->sectors[%d].offset= 0x%08x, bank->sectors[%d].size= 0x%08x",
						  sector, offset, i, bank->sectors[i].offset, i, bank->sectors[i].size);

			LOG_DEBUG("bank->sectors[%d].size = %d",sector, bank->sectors[sector].size);
			LOG_DEBUG("bank->sectors[%d].offset = 0x%08x", sector, bank->sectors[sector].offset);
			LOG_DEBUG("bank->sectors[%d].is_erased = %d",sector, bank->sectors[sector].is_erased);
			LOG_DEBUG("bank->sectors[%d].is_protected = %d", sector, bank->sectors[sector].is_protected);

			/* how many sectors */
			if(count > bank->sectors[sector].size)
			{
				uint32_t next_sect = sector;
				do
				{
					tot_sector++;
					next_sect++;
				}while(count > (bank->sectors[next_sect].offset + bank->sectors[next_sect].size));
			}
			break;
		}
	}



	/* SSD structure */
	if (target_alloc_working_area(target, sizeof(struct _ssd_config),
			&ssd_config) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do SSD config allocation");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};

	err = target_write_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);
	if (err != ERROR_OK)
		return err;

	/* unlock flash registers */
    // LOG_INFO("----> UNLOCK Flash");


	/* flash write code */
	if (target_alloc_working_area(target, sizeof(spc56x_flash_write_code),
			&write_algorithm) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do block memory writes");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};

	err = target_write_buffer(target, write_algorithm->address,
			sizeof(spc56x_flash_write_code), (uint8_t *)spc56x_flash_write_code);
	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
		return err;
	}

	/* memory buffer */
	if (target_alloc_working_area_try(target, chunk_size, &source) != ERROR_OK) {
		LOG_WARNING("no large enough working area available, can't do block memory writes");
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};


	for(i = 0; i < chunk_number; i++)
	{

		err = target_write_buffer(target, source->address,
				size, (uint8_t *)(buffer  + (i * chunk_size)));
		if (err != ERROR_OK) {
			target_free_working_area(target, ssd_config);
			target_free_working_area(target, write_algorithm);
			target_free_working_area(target, source);
			return err;
		}

		init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
		buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

		/* dest */
		init_reg_param(&reg_params[1], "r4", 32, PARAM_IN);
		buf_set_u32(reg_params[1].value, 0, 32, bank->base + offset + (i * chunk_size));
		/* buf_set_u32(reg_params[2].value, 0, 32, 0xFC0000); */

		/* size */
		init_reg_param(&reg_params[2], "r5", 32, PARAM_IN);
		buf_set_u32(reg_params[2].value, 0, 32, size);

		/* source */
		init_reg_param(&reg_params[3], "r6", 32, PARAM_IN);
		buf_set_u32(reg_params[3].value, 0, 32, source->address);

		/* CallBack */
		init_reg_param(&reg_params[4], "r7", 32, PARAM_IN);
		buf_set_u32(reg_params[4].value, 0, 32, 0xFFFFFFFF);



		/*
		 * Link register (in).
		 * Set link register to the breakpoint instruction at the end of the buffer.
		 * We use a software breakpoint to notify when done with algorithm execution.
		 */
		init_reg_param(&reg_params[5], "lr", 32, PARAM_IN);	/* lr */
		buf_set_u32(reg_params[5].value, 0, 32, write_algorithm->address +(sizeof(spc56x_flash_write_code) - 2));

		init_reg_param(&reg_params[6], "r1", 32, PARAM_IN);
		buf_set_u32(reg_params[6].value, 0, 32, target->working_area_phys + target->working_area_size);


		err = target_run_algorithm(target,
				0, NULL,
				7, reg_params,
				write_algorithm->address, (write_algorithm->address + write_algorithm->size),
				2000000000, &powerpc_info);

		LOG_DEBUG("Device buffer Size: %d, Number of iteraction: %d, Current iteraction: %d, err: %d", chunk_size, chunk_number, i, err);

		destroy_reg_param(&reg_params[0]);
		destroy_reg_param(&reg_params[1]);
		destroy_reg_param(&reg_params[2]);
		destroy_reg_param(&reg_params[3]);
		destroy_reg_param(&reg_params[4]);
		destroy_reg_param(&reg_params[5]);
		destroy_reg_param(&reg_params[6]);


		if (err != ERROR_OK)  {
			err = ERROR_TARGET_FAILURE;
			target_free_working_area(target, write_algorithm);
			target_free_working_area(target, source);
			goto flash_write_error;
		}
	}

	if(bytes_remain)
	{
		uint8_t padding_bytes;
		uint32_t ind;
		uint8_t * loc_buffer;
		padding_bytes = bytes_remain % C90FL_PAGE_SIZE;

		if (padding_bytes > 0)
		{
			/* allocate new buffer */
			loc_buffer = malloc(bytes_remain + C90FL_PAGE_SIZE - padding_bytes);

			memset(&loc_buffer[bytes_remain], 0xFF, (C90FL_PAGE_SIZE - padding_bytes));

			for (ind = 0; ind < bytes_remain; ind++)
			{
				loc_buffer[ind] = buffer[(chunk_number * chunk_size) + ind];
			}

			bytes_remain += (C90FL_PAGE_SIZE - padding_bytes);

			err = target_write_buffer(target, source->address,
					bytes_remain, (uint8_t *)(loc_buffer));

			free(loc_buffer);
		}
		else
		{
			err = target_write_buffer(target, source->address,
					bytes_remain, (uint8_t *)(buffer  + (chunk_number * chunk_size)));
		}

		if (err != ERROR_OK) {
			target_free_working_area(target, write_algorithm);
			target_free_working_area(target, source);
			return err;
		}


